src/cfe/КСП/Documents/ТаможеннаяДекларацияЭкспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТаможеннаяДекларацияЭкспорт</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КСП_НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СборСопроводительныхДокументовЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеСчетФактураВыданный</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_ТаможенныйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_ТаможенныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_ОтветственныйСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СопроводительныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаТСД</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КодТС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерТСД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеСчетФактураВыданный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Documents/ТаможеннаяДекларацияЭкспорт/Ext/ObjectModule.bsl
// +++ УваровДС 05/12/2023
// // НЕ УДАЛЯТЬ !!! БЫЛО СДЕЛАНО, НО ТР ПОМЕНЯЛИ !!! НЕ УДАЛЯТЬ

//&После("ОбработкаЗаполнения")
//Процедура КСП_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
//	
//	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
//		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда 
//			ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения.ДокументОснование);
//			Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда

//				// стандартыным методом заполнение возможно если есть СЧЕТ ФАКТУРЫ 
//				////ЗаполнитьПоДокументамОснованиям(ДанныеЗаполнения);
//				//ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Основание);
//				// чтобы подтягивалось налогообложение
//				ЭтотОбъект.КСП_НалогообложениеНДС = ДанныеЗаполнения.ДокументОснование.НалогообложениеНДС;
//				//
//				КСП_КонтрагентПолучателя = ДанныеЗаполнения.ДокументОснование.ОрганизацияПолучатель.КСП_Контрагент;
//				ЭтотОбъект.Контрагент = КСП_КонтрагентПолучателя;
//				ЭтотОбъект.Партнер = КСП_КонтрагентПолучателя.Партнер;
//				ЭтотОбъект.Подразделение = ДанныеЗаполнения.ДокументОснование.Подразделение;
//				//// подобран договор в форме Передача товаров по контрагенту и его партнеру и добавлен
//				ЭтотОбъект.Договор = ДанныеЗаполнения.ДокументОснование.КСП_ДоговорКонтрагентов;
//				// типовым так и так вызывается
//				//ИнициализироватьДокумент(ДанныеЗаполнения); 
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;	
//	
//КонецПроцедуры


&ИзменениеИКонтроль("ЗаполнитьПоДокументамОснованиям")
Процедура КСП_ЗаполнитьПоДокументамОснованиям(ДанныеЗаполнения)

	Если ДокументыОснования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПараметрыДекларации = ПолучитьПараметрыТаможеннойДекларацииПоОснованиям();
    #Вставка
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда 
			ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения.ДокументОснование);
			Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
				Если ПараметрыДекларации.Организация = Неопределено Тогда
					ПараметрыДекларации.Организация = ДанныеЗаполнения.ДокументОснование.Организация;	
				КонецЕсли;
			КонецЕсли;
			Если ТипДанныхЗаполнения = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				Если ПараметрыДекларации.Организация = Неопределено Тогда
					ПараметрыДекларации.Организация = ДанныеЗаполнения.ДокументОснование.Организация;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	#КонецВставки
	Если Не ПараметрыДекларации.Организация = Неопределено Тогда
		ДанныеЗаполнения.Вставить("Организация", ПараметрыДекларации.Организация);
	Иначе
		ВызватьИсключение СтрШаблон(
		НСтр("ru = 'Ввод таможенной декларации на экспорт на основании %1 не требуется.';
		|en = 'Entering export customs declaration based on %1 is not required.'"),
		ДокументыОснования[0].ДокументОснование);
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыДекларации,, "Организация");

КонецПроцедуры

&После("ПередЗаписью")
Процедура КСП_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЭтотОбъект.УстановитьНовыйНомер();
КонецПроцедуры


// --- УваровДС
